In [53]:
import numpy as np
import pandas as pd

In [54]:
data = pd.read_csv('cities.csv')
df = data[['name', 'state_name', 'country_name']]
df =df.rename(columns={"name": "city", "state_name": "state", "country_name": "country"})

In [55]:
df.describe()

          city    state        country
count   150782   150783         150783
unique  132231     3558            203
top     Merkez  England  United States
freq        51     2919          19823

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150783 entries, 0 to 150782
Data columns (total 3 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   city     150782 non-null  object
 1   state    150783 non-null  object
 2   country  150783 non-null  object
dtypes: object(3)
memory usage: 3.5+ MB

In [57]:
df['country'].nunique()

203

In [58]:
df['continent'] = None

In [59]:
df

                       city              state      country continent
0                 Ashkāsham         Badakhshan  Afghanistan      None
1                  Fayzabad         Badakhshan  Afghanistan      None
2                      Jurm         Badakhshan  Afghanistan      None
3                   Khandūd         Badakhshan  Afghanistan      None
4                 Rāghistān         Badakhshan  Afghanistan      None
...                     ...                ...          ...       ...
150778             Redcliff  Midlands Province     Zimbabwe      None
150779             Shangani  Midlands Province     Zimbabwe      None
150780             Shurugwi  Midlands Province     Zimbabwe      None
150781    Shurugwi District  Midlands Province     Zimbabwe      None
150782  Zvishavane District  Midlands Province     Zimbabwe      None

[150783 rows x 4 columns]

In [70]:
continents = pd.read_csv('continents.csv')
for i in range(len(df)):
    country = df.iloc[i:i+1]['country'].values[0]
    continent = continents[continents['Country'] == country]['Continent'].values
    # print(continent)
    if len(continent) != 0:
        df.loc[i:i+1, 'continent'] = continent[0]

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150783 entries, 0 to 150782
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   city       150782 non-null  object
 1   state      150783 non-null  object
 2   country    150783 non-null  object
 3   continent  148312 non-null  object
dtypes: object(4)
memory usage: 4.6+ MB

In [73]:
df_copy = df.dropna()

In [74]:
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
Index: 148311 entries, 0 to 150782
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   city       148311 non-null  object
 1   state      148311 non-null  object
 2   country    148311 non-null  object
 3   continent  148311 non-null  object
dtypes: object(4)
memory usage: 5.7+ MB

In [76]:
# df_copy.to_csv('dataset/processed_data.csv', sep=',', index=False)